{
	"title": "Quakers draw opening two matches for first time in program history",
	"description": "2-2 affair with American, 1-1 battle with Seton Hall start off season",
	"date": "09/06/16",
	"author": "NICK BUCHTA",
	"image-front": {
		"image": "/sample_content/article2/img.jpg",
		"caption": "Freshman forward Dami Omitaomu was one of several Quakers to catch the eye over the weekend, winning a penalty against American on Friday night and impressing once more against Seton Hall on Monday."
	},
	"content": {
		"html": "<p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Two games into the 2016 season, Penn men’s soccer is undefeated. It’s also winless. For the first time in program history, the Quakers have begun their slate of games with a pair of draws — a 2-2 effort against American on Friday, followed by a 1-1 affair at Seton Hall on Monday.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">After being held to a single goal in their first six matches of 2015, the Red and Blue (0-0-2) matched that total in the 37th minute of the year when junior right back Sam Wancowicz chested down a long ball and rifled it past the American keeper to put his team up, 1-0.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">“I decided, ‘Why not?’” Wancowicz said, “tried to go through a couple people, I took a shot, and fortunately, it went in.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Just a few minutes later, the Eagles (1-0-2) capitalized on a corner kick to level the game at 1-1.</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">“With that lack of communication, switching off at the corner kick, we should have been 1-0 up at halftime,” Wancowicz lamented.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">After halftime, the Quakers were put under a long period of pressure, which ultimately led to an American goal in the 53rd minute. Rather than let their chins down, though, the team was quick to respond.</span></p>\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"integrated-media-left\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"info-box\">\n\t\t\t\t\t\t\t\t\t<p><strong style=\"background-color: initial;\">Related:</strong></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-rejuvenated-offense\" target=\"_blank\">Men's Soccer Issue | Quakers seek rejuvenated offense in 2016</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-fine-outlook-column\" target=\"_blank\">Men's Soccer Issue | Fine: High ceiling for Quakers in 2016</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-moving-past-2015\" target=\"_blank\">Men's Soccer Issue | Quakers gear up to move on from disappointing 2015</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-nebraska-trip-preview\" target=\"_blank\">Men's Soccer Issue | Penn prepares for top-flight competition during weekend in Nebraska</a></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Freshman debutant Dami Omitaomu ran down the wing after the restart, beat his opponent into the box, and was then dragged down by him, winning his side a penalty kick. Senior forward Alec Neumann put the penalty into the back of the net to tie the game up again at 2-2. While there were more chances, the scoreline ultimately held for the rest of regulation and the two overtime periods.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">“We would love to have finished out with a win,” Omitaomu said. “But this is a good way to build. We will learn from this, and move on.”</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Sunday, it seemed the Quakers had a ready-made chance to build off of the 2-2 draw. Just seven minutes into the contest, sophomore midfielder Patrick Burd was sent off with a straight red card after stomping on Penn junior Sam Wancowicz — leading to the first of several near-brawls on the evening — and Seton Hall (1-2-1) was forced to play a man down for the duration of play.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Despite the disadvantage, however, it was the Pirates who struck first. A perfectly placed through ball was followed by a somehow more perfect shot from Jonathan Jimenez, who found the top right corner of the goal over Penn sophomore goalkeeper Etan Mabourakh’s arms.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">The Pirates maintained control throughout much oft he first half, but the Red and Blue took only a one-goal deficit into the half. Out of the break, the Quakers came to life — tying things up when freshman Arty Kouzine emerged from chaos in the box to find the equalizer.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">“I felt like if we had a different makeup of our roster — maybe if we had sever or eight seniors on the field — then it would have been a little bit different,” Penn coach Rudy Fuller noted. “But we were still trying to feel our way through it.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Penn threatened for much of the rest of the game but never could find the net again, leaving a feeling of dissatisfaction in the air.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">“We really wanted to try and get a better result here but for the second time in a row, they showed some resiliency and grit,” Fuller noted.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"4\">Draws in hand, the undefeated Quakers will seek their first win of the year as they head to Nebraska for a pair of games this coming weekend.</span></p>"
	}
}
