{
	"title": "Quakers seek rejuvenated offense in 2016",
	"description": "Scoring woes plagued Red and Blue in 2015",
	"date": "09/06/16",
	"author": "SANJAY DURESETI",
	"image-front": {
		"image": "/sample_content/article1/img.jpg",
		"caption": "Freshman striker Aramis \"Arty\" Kouzine is one of a few rookies who have been brought in with the intention of revamping the Quakers' front line — and it has already paid dividends, with the 6'2 forward scoring the equalizing goal at Seton Hall on Monday night."
	},
	"content": {
		"html": 
			"<p><span class=\"[No character style]\" tracking=\"-10\">Penn men’s soccer, still nursing the wounds of last season, nevertheless enters a new year with optimism and a set of fresh, young faces who will look to make their mark on the field. The team attempts to move on from a disastrous spate of play over the course of 2015, during which the Quakers compiled a record of 3-11-3 and recorded just one win against an Ivy League opponent.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">The Red and Blue, however, will restore some bite to their toothless offense through the addition of an attack-minded recruiting class. Penn coach Rudy Fuller and his staff focused heavily on bringing in proven scorers and creators to help a team that scored just one goal through the first seven matches of last season. Out of the five freshmen, four are midfielders and forwards, a number that is far from accidental.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">“The group that were freshmen last year was really focused on the back half, on the midfield back,” Fuller said. “When we were going into [recruiting] for the 2016 recruits, we really felt like we had to fill some holes and give use some depth in the attacking half.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">Fuller attributes last year’s dearth of production to the lack of “natural attacking players,” with only sophomore Jerel Blades and senior captain Alec Neumann demonstrating genuine offensive instincts.</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">This year, those players will be joined by the likes of freshmen Dami Omitaomu, Sam Hefter and Arty Kouzine, who all excel at creating and converting scoring opportunities.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">Omitaomu is a particularly intriguing addition. Despite his diminutive stature, he is a menace on the flank, using his exceptional speed to regularly burn defenders. Omitaomu’s main aim as an attacking midfielder, however, is to get his teammates involved.</span></p>\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\"><blockquote>“My biggest strength as an offensive player is my speed and craftiness on the ball, which I like to use to get other people into the play,” the Nigerian-born Omitaomu said. “Even though the collegiate game is more physical, I can use my speed to get defenders on their heels.”</blockquote></span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">With Blades and Omitaomu on the field simultaneously, the Red and Blue can outrun anyone, a feature that excites Fuller and, as he says, makes everything a little bit easier.</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"10\">“Speed kills,” Fuller said. “Speed can create something out of nothing and I think that Dami and Jerel both have it. But I also think the two of them are very different players. Even though they both have pace, I think Jerel is really good at running behind and getting on the end of things and Dami is a little bit more slippery. He’s a little bit better in tighter spaces and creating things off the dribble.”</span></p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ZZ5LpwO-An4\" frameborder=\"0\" allowfullscreen></iframe><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">Kouzine is another young player who will receive substantial playing time in Fuller’s system. The long-limbed forward, who is measured at 6-foot-2, towers over his freshman colleague Omitaomu, but is equally artful on the ball. While figuring to be a prime target in Penn’s aerial attack off of set pieces, Kouzine has also been described as a natural goalscorer.</span></p><img src=\"sample_content/article1/img.player.jpg\" class=\"img-responsive\" alt=\"Responsive image\"><p>This is a picture of something related to Penn Soccer</p><div class=\"line-divider\"></div><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">“He’s a No. 9 target forward and he’s got deceptively soft feet. He’s very skilled for a guy his size,” commented Fuller. “And he has the good fortune of working with Alec Neumann, who’s been through the wars, who’s an Ivy League champion, who’s played a lot of minutes.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">“I’m kind of crafty when I’ve got bigger defenders on my back and I can turn them quite easily and beat them with pace,” Kouzine said. “I’d say I’m pretty versatile, I may not do everything perfect but I do everything pretty well.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\" tracking=\"-4\">So with the introduction of these new forward-minded freshmen, hopes are high that the Red and Blue’s attacking machine will be firing on all cylinders this season.</span></p>"
	}
}
