{
	"title": "Quakers gear up to move on from disappointing 2015",
	"description": "Injuries, youth sunk last year's campaign",
	"date": "09/06/16",
	"author": "WILL SNOW",
	"image-front": {
		"image": "/sample_content/article3/img.jpg",
		"caption": "Penn men's soccer is trying to move beyond a troublesome 2015. One example of such progress is junior fullback Sam Wancowicz — who spent half of last season injured, but scored a screamer on Friday night against American University to open the Quakers' scoring for the season."
	},
	"content": {
		"html": "<p class=\"DP Article 2014\"><span class=\"[No character style]\">2015 was a year to forget for Penn men’s soccer.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">Three wins out of</span><span class=\"[No character style]\"> 16 games, including just one against a conference opponent. Seventh in the Ivy League, after having won the league just two years ago</span><span class=\"[No character style]\">. Star players were </span><span class=\"[No character style]\">injured, others underperformed</span><span class=\"[No character style]\">.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">But this is a new year, and thankfully for the Quakers, this is a new team.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">There are a lot of things the team will have to do in order to find success this year, but one of the first tasks will be to put the past season behind them — or perhaps use it to their advantage.</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\">For example, because of all the injuries to the squad, head coach Rudy Fuller was forced to throw freshmen into the mix, even once sending out a starting unit of ten rookies</span><span class=\"[No character style]\">. That worked against the team</span><span class=\"[No character style]\"> in the short term, but giving freshmen so much playing time helped them adjust more quickly to the college game.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We had a lot of freshmen step into starting positions last year, probably before they were ready,” Fuller said. “And they got shaken up a bit. I think there were a lot of lessons learned last year, and that having that year under their belt is going to benefit them and this program greatly going into this fall.”</span></p>\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"integrated-media-left\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"info-box\">\n\t\t\t\t\t\t\t\t\t<p><strong>Related:</strong></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-rejuvenated-offense\" target=\"_blank\">Men's Soccer Issue | Quakers seek rejuvenated offense in 2016</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-fine-outlook-column\" target=\"_blank\">Men's Soccer Issue | Fine: High ceiling for Quakers in 2016</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-american-seton-hall-recap\" target=\"_blank\">Men's Soccer Issue | Penn opens year with draw with American, win over Seton Hall</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-nebraska-trip-preview\" target=\"_blank\">Men's Soccer Issue | Penn prepares for top-flight competition during weekend in Nebraska</a></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\">Another thing for the Quakers to look forward to this season is that, for the most part, they have the same squad. The team lost six seniors to graduation, but only a pair of them were regular starters. Unit cohesion should advantage the Red and Blue against their opponents this season, who will likely have had less time working together as a side.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We’ve got a lot of camaraderie coming back,” junior defender Sam Wancowicz said. “Team spirit is high. We’re looking forward to a good year.”</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\">Fellow junior Joe Swenson echoed his sentiment, showing a very positive outlook towards the season.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“I think we’ve got more of an understanding with each other,” the midfielder said. “Everything is starting to come together.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">Swenson was spot on, it seems — looking between the first game of 2015 and the season opener on Friday night, both against American, the progress the team has made in the past 12 months is easy to see.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">Last year’s trip to American was a torrid affair: the Quakers fell 4-0 in what would be the beginning of a dismal stretch of matches.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">This year’s season opening match against the Eagles, however, was full of hope and promise — a 2-2 draw in which the Red and Blue had several chances even to win the game and</span><span class=\"[No character style]\"> showed the world a glimpse of what this season could be</span><span class=\"[No character style]\">.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">Before anyone declares them Ivy title contenders, though, a few caveats must be placed. 2015 saw the team hit by multiple injury crises, limiting their ability to compete against higher-quality opposition. If 2016 is to be a successful season, Fuller declared, fitness is pivotal to the team.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We’ve got to keep everyone healthy. I think if we keep everyone healthy, we have a really good shot at being successful.”</span></p>"
	}
}
