{
	"title": "Penn prepares for top-flight competition during weekend in Nebraska",
	"description": "Nebraska-Omaha, No. 8 Creighton await Quakers",
	"date": "09/06/16",
	"author": "JACOB SNYDER",
	"image-front": {
		"image": "/sample_content/article4/img.jpg",
		"caption": "Penn men's soccer faces a tough road trip this weekend, including a fixture against a top-10 team in No. 8 Creighton. Head coach Rudy Fuller said he plans these hard matches to bring the level of his players up as high as possible."
	},
	"content": {
		"html": "<p class=\"DP Article 2014\"><span class=\"[No character style]\">After a stellar start to the 2016 season, Penn men’s soccer will be looking to this weekend’s trip to Nebraska as an opportunity to assess the team’s improvement and depth.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">This Friday’s contest against No. 8 Creighton followed by Sunday’s clash against University of Nebraska-Omaha provide two difficult matches in three days, the only time this season that the Quakers (0-0-2) will have such a short turnaround.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">Interestingly, the two Nebraska universities played each other Monday night, battling to a 1-1 draw and showing the quality the Quakers will be up against this weekend.</span><span class=\"[No character style]\"> </span><span class=\"[No character style]\">Despite the quality of competition and the long flight, some more nuanced factors come into play with extended trips like these.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“Dealing with the Friday-Sunday schedule is a real challenge in terms of preparation,” Penn&nbsp;coach Rudy Fuller said. “It’s especially difficult when you’re up against two quality opponents in Creighton and Omaha.”</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\">Sophomore forward Jerel Blades echoed Fuller, adding that the Red and Blue will stick to what they know out west.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“Obviously the location changes, but the gameplan always stays the same,” Blades said. “It’s a great time to bond with the guys. Not much else changes.”</span></p>\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"integrated-media-left\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"info-box\">\n\t\t\t\t\t\t\t\t\t<p><strong style=\"background-color: initial;\">Related:</strong></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-rejuvenated-offense\" target=\"_blank\">Men's Soccer Issue | Quakers seek rejuvenated offense in 2016</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-fine-outlook-column\" target=\"_blank\">Men's Soccer Issue | Fine: High ceiling for Quakers in 2016</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-american-seton-hall-recap\" target=\"_blank\">Men's Soccer Issue | Penn opens year with pair of draws</a></p><p><a href=\"http://www.thedp.com/article/2016/09/penn-mens-soccer-moving-past-2015\" target=\"_blank\">Men's Soccer Issue | Quakers gear up to move on from disappointing 2015</a></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\">The team’s 2-2 and 1-1 draws to start the campaign mean that the Quakers already have more goals in their first two games than they did in their first six matches last year. Good performances against Creighton</span><span class=\"[No character style]\"> (1-1-0) and Omaha (2-1-0) could be essential to the team’s confidence heading into the brunt of the season.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We have a lot of young guys, so especially with younger teams you like to build momentum quickly and get everyone on the same page,” senior midfielder Matt Poplowski said. “Winning games early can keep guys’ confidence high and help them on the field.”</span></p>\n\n\t\t\t\t\t\t<!--MOBILE AD-->\n\n\t\t\t\t\t\t<p class=\"DP Article 2014\"><span class=\"[No character style]\">Fuller noted that early success can build confidence, and also commented on the team’s internal atmosphere.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We feel good at this point in the season. There’s a really good energy about the guys and there’s a great spirit,” Fuller said. “We know we have a difficult stretch of games coming up, but confidence is high right now.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">Over 20&nbsp;different Penn players have gotten minutes in the two games thus far, indicating that some of the starting roles are still up for grabs. When asked about the rigidity of the depth chart, Fuller seemed hesitant to jump to any conclusions.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“You hope you have a good feel of the group at this point in the season, but things can certainly change,” Fuller said. “Guys develop at different rates, and you have a number of guys who it’s their first year in the program. You don’t know how those guys will respond to the higher level. Fortunately, we have a lot of experienced guys that will help us out while the new guys are adjusting.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">In addition to the obvious strength of Creighton and Omaha, the Red and Blue will also be battling against a statistical obstacle —&nbsp;the Quakers have not won a game away from the east coast since 2009. Although the odds are stacked against Penn, the team insists that the expectations for this weekend remain the same as always.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We want to win any game we play,” Fuller said. “I think a lot of these guys have been on successful teams and either played with or against a lot of the guys we’ll be seeing this weekend.”</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“Creighton is a huge stage, playing in front of seven thousand people,” Blades said.</span></p><p class=\"DP Article 2014\"><span class=\"[No character style]\">“We definitely want to show them what Penn soccer is all about.”</span></p>"
	}
}
